lkolbly/cmsis-svd/data/Atmel/ATSAM4C16C_0.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SLCDC</name>
      <version>6259D</version>
      <description>Segment LCD Controller</description>
      <prependToName>SLCDC_</prependToName>
      <baseAddress>0x4003C000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x4000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SLCDC</name>
        <value>32</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <description>SLCDC Control Register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>LCDEN</name>
              <description>Enable the LCDC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LCDDIS</name>
              <description>Disable LCDC</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SWRST</name>
              <description>Software Reset</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MR</name>
          <description>SLCDC Mode Register</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>COMSEL</name>
              <description>Selection of the Number of Commons</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COM_0</name>
                  <description>COM0 is driven by SLCDC, COM1:5 are driven by digital function</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COM_0TO1</name>
                  <description>COM0:1 are driven by SLCDC, COM2:5 are driven by digital function</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COM_0TO2</name>
                  <description>COM0:2 are driven by SLCDC, COM3:5 are driven by digital function</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COM_0TO3</name>
                  <description>COM0:3 are driven by SLCDC, COM4:5 are driven by digital function</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COM_0TO4</name>
                  <description>COM0:4 are driven by SLCDC, COM5 is driven by digital function</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COM_0TO5</name>
                  <description>COM0:5 are driven by SLCDC, No COM pin driven by digital function</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEGSEL</name>
              <description>Selection of the Number of Segments</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUFTIME</name>
              <description>Buffer On-Time</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Nominal drive time is 0% of SLCK period</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>X2_SLCK_PERIOD</name>
                  <description>Nominal drive time is 2 periods of SLCK clock</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>X4_SLCK_PERIOD</name>
                  <description>Nominal drive time is 4 periods of SLCK clock</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>X8_SLCK_PERIOD</name>
                  <description>Nominal drive time is 8 periods of SLCK clock</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>X16_SLCK_PERIOD</name>
                  <description>Nominal drive time is 16 periods of SLCK clock</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>X32_SLCK_PERIOD</name>
                  <description>Nominal drive time is 32 periods of SLCK clock</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>X64_SLCK_PERIOD</name>
                  <description>Nominal drive time is 64 periods of SLCK clock</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>X128_SLCK_PERIOD</name>
                  <description>Nominal drive time is 128 periods of SLCK clock</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PERCENT_50</name>
                  <description>Nominal drive time is 50% of SLCK period</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PERCENT_100</name>
                  <description>Nominal drive time is 100% of SLCK period</description>
                  <value>0x9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BIAS</name>
              <description>LCD Display Configuration</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STATIC</name>
                  <description>Static</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIAS_1_2</name>
                  <description>Bias 1/2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIAS_1_3</name>
                  <description>Bias 1/3</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPMODE</name>
              <description>Low Power Mode</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FRR</name>
          <description>SLCDC Frame Rate Register</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRESC</name>
              <description>Clock Prescaler</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SLCK_DIV8</name>
                  <description>Slow clock is divided by 8</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLCK_DIV16</name>
                  <description>Slow clock is divided by 16</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLCK_DIV32</name>
                  <description>Slow clock is divided by 32</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLCK_DIV64</name>
                  <description>Slow clock is divided by 64</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLCK_DIV128</name>
                  <description>Slow clock is divided by 128</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLCK_DIV256</name>
                  <description>Slow clock is divided by 256</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLCK_DIV512</name>
                  <description>Slow clock is divided by 512</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLCK_DIV1024</name>
                  <description>Slow clock is divided by 1024</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIV</name>
              <description>Clock Division</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PRESC_CLK_DIV1</name>
                  <description>Clock output from prescaler is divided by 1</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESC_CLK_DIV2</name>
                  <description>Clock output from prescaler is divided by 2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESC_CLK_DIV3</name>
                  <description>Clock output from prescaler is divided by 3</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESC_CLK_DIV4</name>
                  <description>Clock output from prescaler is divided by 4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESC_CLK_DIV5</name>
                  <description>Clock output from prescaler is divided by 5</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESC_CLK_DIV6</name>
                  <description>Clock output from prescaler is divided by 6</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESC_CLK_DIV7</name>
                  <description>Clock output from prescaler is divided by 7</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESC_CLK_DIV8</name>
                  <description>Clock output from prescaler is divided by 8</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DR</name>
          <description>SLCDC Display Register</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DISPMODE</name>
              <description>Display Mode Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Normal Mode-Latched data are displayed.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FORCE_OFF</name>
                  <description>Force Off Mode-All pixels are invisible. (The SLCDC memory is unchanged.)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FORCE_ON</name>
                  <description>Force On Mode-All pixels are visible. (The SLCDC memory is unchanged.)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLINKING</name>
                  <description>Blinking Mode-All pixels are alternately turned off to the predefined state in SLCDC memory at LCDBLKFREQ frequency. (The SLCDC memory is unchanged.)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERTED</name>
                  <description>Inverted Mode-All pixels are set in the inverted state as defined in SLCDC memory. (The SLCDC memory is unchanged.)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERTED_BLINK</name>
                  <description>Inverted Blinking Mode-All pixels are alternately turned off to the predefined opposite state in SLCDC memory at LCDBLKFREQ frequency. (The SLCDC memory is unchanged.)</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USER_BUFFER_LOAD</name>
                  <description>User Buffer Only Load Mode-Blocks the automatic transfer from User Buffer to Display Buffer.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUFFERS_SWAP</name>
                  <description>Buffer Swap Mode-All pixels are alternatively assigned to the state defined in the User Buffer, then to the state defined in the Display Buffer at LCDBLKFREQ frequency.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LCDBLKFREQ</name>
              <description>LCD Blinking Frequency Selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>SLCDC Status Register</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ENA</name>
              <description>Enable Status (Automatically Set/Reset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IER</name>
          <description>SLCDC Interrupt Enable Register</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>ENDFRAME</name>
              <description>End of Frame Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DIS</name>
              <description>SLCDC Disable Completion Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDR</name>
          <description>SLCDC Interrupt Disable Register</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>ENDFRAME</name>
              <description>End of Frame Interrupt Disable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DIS</name>
              <description>SLCDC Disable Completion Interrupt Disable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IMR</name>
          <description>SLCDC Interrupt Mask Register</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>ENDFRAME</name>
              <description>End of Frame Interrupt Mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS</name>
              <description>SLCDC Disable Completion Interrupt Mask</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ISR</name>
          <description>SLCDC Interrupt Status Register</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ENDFRAME</name>
              <description>End of Frame Interrupt Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS</name>
              <description>SLCDC Disable Completion Interrupt Status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
